# # # Pandas

In [8]:
import pandas as pd

In [35]:
df_exams=pd.read_csv('StudentsPerformance.csv')
df_exams.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

# 1.Math Operations

# 1.1 Operations in column

In [4]:
#select a column and calculate total sum
df_exams['math score'].sum()

np.int64(66089)

In [12]:
#count,mean,std,max,and min    
# df_exams['math score'].max()
# df_exams['math score'].mean()
# df_exams['math score'].count()
# df_exams['math score'].min()
# df_exams['math score'].std()

15.163080096009468

In [15]:
# easier calculation with .describe()
df_exams.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [16]:
#calculating the sum in a row
df_exams['math score']+df_exams['reading score']+df_exams['writing score']

0      218
1      247
2      278
3      148
4      229
      ...
995    282
996    172
997    195
998    223
999    249
Length: 1000, dtype: int64

In [17]:
#calculating the average score and assigning the result to a new column
df_exams['average']=(df_exams['math score']+df_exams['reading score']+df_exams['writing score'])/3

In [19]:
df_exams.round(2)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,average
0,female,group B,bachelor's degree,standard,none,72,72,74,72.67
1,female,group C,some college,standard,completed,69,90,88,82.33
2,female,group B,master's degree,standard,none,90,95,93,92.67
3,male,group A,associate's degree,free/reduced,none,47,57,44,49.33
4,male,group C,some college,standard,none,76,78,75,76.33
...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,94.00
996,male,group C,high school,free/reduced,none,62,55,55,57.33
997,female,group C,high school,free/reduced,completed,59,71,65,65.00
998,female,group D,some college,standard,completed,68,78,77,74.33
999,female,group D,some college,free/reduced,none,77,86,86,83.00

# 1 Value Counts

In [10]:
#len function
len(df_exams['gender'])
#.count method 
df_exams['gender'].count()

np.int64(1000)

In [11]:
#counting gender elements by category
df_exams['gender'].value_counts()

gender
female    518
male      482
Name: count, dtype: int64

In [12]:
#return the relative frequency(percentage) devide all values by the sum of values
df_exams['gender'].value_counts(normalize=True)

gender
female    0.518
male      0.482
Name: proportion, dtype: float64

In [13]:
#counting "parental level of education" elements by category
df_exams['parental level of education'].value_counts()

parental level of education
some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
Name: count, dtype: int64

In [14]:
#To get the relative frequency and round to 2 decimal places
df_exams['parental level of education'].value_counts(normalize=True).round(2)

parental level of education
some college          0.23
associate's degree    0.22
high school           0.20
some high school      0.18
bachelor's degree     0.12
master's degree       0.06
Name: proportion, dtype: float64

# 1.Sort a dataframe

In [16]:
#sort by one column
df_exams.sort_values('math score')

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
59,female,group C,some high school,free/reduced,none,0,17,10
980,female,group B,high school,free/reduced,none,8,24,23
17,female,group B,some high school,free/reduced,none,18,32,28
787,female,group B,some college,standard,none,19,38,32
145,female,group C,some college,free/reduced,none,22,39,33
...,...,...,...,...,...,...,...,...
625,male,group D,some college,standard,completed,100,97,99
623,male,group A,some college,standard,completed,100,96,86
451,female,group E,some college,standard,none,100,92,97
962,female,group E,associate's degree,standard,none,100,100,100
149,male,group E,associate's degree,free/reduced,completed,100,100,93

In [18]:
# sort descending by one column(by default ascending=True)
df_exams.sort_values('math score',ascending=False)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
962,female,group E,associate's degree,standard,none,100,100,100
625,male,group D,some college,standard,completed,100,97,99
458,female,group E,bachelor's degree,standard,none,100,100,100
623,male,group A,some college,standard,completed,100,96,86
451,female,group E,some college,standard,none,100,92,97
...,...,...,...,...,...,...,...,...
145,female,group C,some college,free/reduced,none,22,39,33
787,female,group B,some college,standard,none,19,38,32
17,female,group B,some high school,free/reduced,none,18,32,28
980,female,group B,high school,free/reduced,none,8,24,23
59,female,group C,some high school,free/reduced,none,0,17,10

In [19]:
# sort descending by multiple columns
df_exams.sort_values(['math score','reading score','writing score'],ascending=False)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
458,female,group E,bachelor's degree,standard,none,100,100,100
916,male,group E,bachelor's degree,standard,completed,100,100,100
962,female,group E,associate's degree,standard,none,100,100,100
149,male,group E,associate's degree,free/reduced,completed,100,100,93
625,male,group D,some college,standard,completed,100,97,99
...,...,...,...,...,...,...,...,...
145,female,group C,some college,free/reduced,none,22,39,33
787,female,group B,some college,standard,none,19,38,32
17,female,group B,some high school,free/reduced,none,18,32,28
980,female,group B,high school,free/reduced,none,8,24,23
59,female,group C,some high school,free/reduced,none,0,17,10

In [ ]:
# sort descending by multiple columns and update dataframe
#if i run df_exams there will be no change to make a change permanently
df_exams.sort_values(['math score','reading score','writing score'],ascending=False,inplace=True)

In [20]:
# lets put race/ethinicity in descending order
df_exams.sort_values('race/ethnicity',ascending=True)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
778,female,group A,some college,standard,completed,72,79,82
546,female,group A,some high school,standard,completed,92,100,97
820,female,group A,some high school,standard,completed,85,90,92
741,female,group A,associate's degree,free/reduced,none,37,57,56
305,male,group A,some college,standard,none,69,67,69
...,...,...,...,...,...,...,...,...
297,male,group E,associate's degree,standard,completed,71,74,68
293,female,group E,bachelor's degree,standard,none,65,73,75
289,male,group E,some high school,standard,completed,77,76,77
206,male,group E,bachelor's degree,standard,none,82,62,62
499,male,group E,some college,standard,none,76,71,72

# 2. Create an Index

In [83]:
import numpy as np
import random

In [84]:
#creating non repetitive values for the index
new_index=np.arange(0,1000)

In [85]:
#shuffling the indexes
random.shuffle(new_index)

In [86]:
df_exams['new_index']= new_index

In [87]:
df_exams.set_index('new_index',inplace=True)
df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,MS,RS,WS
new_index,,,,,,,,
183,male,group B,some college,standard,none,62,61,57
270,male,group D,master's degree,standard,none,73,70,75
946,male,group E,some college,standard,none,59,51,43
632,male,group D,associate's degree,standard,none,71,66,60
50,female,group D,associate's degree,standard,none,82,95,89
...,...,...,...,...,...,...,...,...
648,female,group A,high school,standard,none,55,73,73
450,male,group C,high school,standard,none,52,53,49
661,male,group C,some college,standard,none,53,44,42
581,male,group C,high school,standard,none,68,60,53
98,male,group C,some college,free/reduced,none,35,28,27

In [90]:
df_exams.sort_index(ascending=True,inplace=True)

In [91]:
df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,MS,RS,WS
new_index,,,,,,,,
0,male,group C,some high school,standard,none,64,58,51
1,male,group A,some high school,standard,none,64,50,43
2,female,group B,some high school,free/reduced,none,24,38,27
3,male,group C,high school,standard,completed,82,84,82
4,male,group C,associate's degree,standard,none,83,72,78
...,...,...,...,...,...,...,...,...
995,female,group D,some high school,standard,none,68,71,75
996,female,group B,associate's degree,standard,none,73,83,76
997,female,group C,associate's degree,free/reduced,none,64,73,68
998,female,group B,high school,free/reduced,completed,23,44,36
999,male,group C,high school,standard,completed,75,69,68

# 3.Rename Column

In [92]:
#rename column and overwrite values of the dataframes
df_exams.rename(columns={'gender':'Gender'})

,Gender,race/ethnicity,parental level of education,lunch,test preparation course,MS,RS,WS
new_index,,,,,,,,
0,male,group C,some high school,standard,none,64,58,51
1,male,group A,some high school,standard,none,64,50,43
2,female,group B,some high school,free/reduced,none,24,38,27
3,male,group C,high school,standard,completed,82,84,82
4,male,group C,associate's degree,standard,none,83,72,78
...,...,...,...,...,...,...,...,...
995,female,group D,some high school,standard,none,68,71,75
996,female,group B,associate's degree,standard,none,73,83,76
997,female,group C,associate's degree,free/reduced,none,64,73,68
998,female,group B,high school,free/reduced,completed,23,44,36
999,male,group C,high school,standard,completed,75,69,68

In [93]:
df_exams.rename(columns={
    'math score': 'MS',
    'reading score': 'RS',
    'writing score': 'WS'
}, inplace=True)

In [94]:
df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,MS,RS,WS
new_index,,,,,,,,
0,male,group C,some high school,standard,none,64,58,51
1,male,group A,some high school,standard,none,64,50,43
2,female,group B,some high school,free/reduced,none,24,38,27
3,male,group C,high school,standard,completed,82,84,82
4,male,group C,associate's degree,standard,none,83,72,78
...,...,...,...,...,...,...,...,...
995,female,group D,some high school,standard,none,68,71,75
996,female,group B,associate's degree,standard,none,73,83,76
997,female,group C,associate's degree,free/reduced,none,64,73,68
998,female,group B,high school,free/reduced,completed,23,44,36
999,male,group C,high school,standard,completed,75,69,68

In [97]:
#rename index 0,1 and 2 and update the dataframe
df_exams.rename(index={0:'A',1:'B',2:'C'},inplace=True)

In [100]:
df_exams.head(3)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,MS,RS,WS
new_index,,,,,,,,
A,male,group C,some high school,standard,none,64,58,51
B,male,group A,some high school,standard,none,64,50,43
C,female,group B,some high school,free/reduced,none,24,38,27